# Даны два файла, в каждом из которых находится запись многочлена.
# Задача - сформировать файл, содержащий сумму многочленов.

data1 = open('for_task5/polynomial_1.txt','r')
str1 = data1.read()
data2 = open('for_task5/polynomial_2.txt','r')
str2 = data2.read()
print(str1)
print(str2)